Polygon segment too short
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PolygonSegmentTooShort { get; }
  Visual Basic
Public Shared ReadOnly Property PolygonSegmentTooShort As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PolygonSegmentTooShort {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeometryFailures Class
  Autodesk.Revit.DB Namespace